@orz-nil I am unable to reproduce this. What is the provider configuration set to ? What is the region you are trying this ?

```
Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_ecr_repository_creation_template.example will be created
  + resource "awscc_ecr_repository_creation_template" "example" {
      + applied_for              = [
          + "PULL_THROUGH_CACHE",
        ]
      + created_at               = (known after apply)
      + description              = "pass"
      + encryption_configuration = (known after apply)
      + id                       = (known after apply)
      + image_tag_mutability     = (known after apply)
      + lifecycle_policy         = (known after apply)
      + prefix                   = "test"
      + repository_policy        = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:BatchGetImage",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchImportUpstreamImage",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = [
                                  + "arn:aws:iam::############:role/*",
                                  + "arn:aws:iam::############:role/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Sid       = "AllowCrossAccountPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + resource_tags            = (known after apply)
      + updated_at               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_ecr_repository_creation_template.example: Creating...
awscc_ecr_repository_creation_template.example: Creation complete after 6s [id=test]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```